Config/Catalogs/НачисленияСтудентамЗаПрочиеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НачисленияСтудентамЗаПрочиеУслуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовоеНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияУчащимся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияУчащимся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияУчащимся</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДолгосрочнымДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКраткосрочнымДоговорам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ПорядокВыпискиСФЗаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокВыпискиСФЗаУслуги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сводно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПлательщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/НачисленияСтудентамЗаПрочиеУслуги/Forms/ФормаВыбораСОтборами/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ПараметрыОтбора;
	Параметры.Свойство("Отбор", ПараметрыОтбора);
	
	ПараметрыОтбора.Свойство("ОтборСтудент", ОтборСтудент);
	ПараметрыОтбора.Свойство("НачалоПериода", НачалоПериода);
	ПараметрыОтбора.Свойство("КонецПериода", КонецПериода);
	ПараметрыОтбора.Свойство("ОтборНачисление", ОтборНачисление);
	ПараметрыОтбора.Свойство("НаДату", ОтборНаДату);
		
	Если Не ЗначениеЗаполнено(ОтборНаДату) Тогда
		ОтборНаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ОтборВидНачисления") Тогда
		
		ЕстьОтборПоВидуНачисления = Истина;
		УстановитьОтборПоВидуНачисления(ПараметрыОтбора.ОтборВидНачисления);
		
		Заголовок = СтрШаблон("%1 (%2)", Заголовок, ПараметрыОтбора.ОтборВидНачисления);
		ПоДолгосрочнымДоговорам = (ПараметрыОтбора.ОтборВидНачисления = Перечисления.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам);
		
	КонецЕсли;
	
	УстановитьПараметрСтудент();
	УстановитьПараметрНаДату();
	УстановитьОтборНачисление();
	УстановитьПараметрСпискаПериод();
	УстановитьПредставлениеПериода();
	УстановитьВидимостьЭлементов();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтудентПриИзменении(Элемент)
	УстановитьПараметрСтудент();
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНачислениеПриИзменении(Элемент)
	УстановитьОтборНачисление();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ВыбираемыйПериод", НачалоПериода);
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборПериода", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Студент) Тогда
		КнопкиДиалога = Новый СписокЗначений;
		КнопкиДиалога.Добавить(КодВозвратаДиалога.Да, "Изменить начисление");
		КнопкиДиалога.Добавить(КодВозвратаДиалога.Нет, "Изменить учащегося");
		
		ТекстВопроса = НСтр("ru='Если необходимо изменить данные начисления (ставку оплаты, параметры учета НДС и др.), нажмите ""Изменить начисление"".'") + Символы.ПС + 
					НСтр("ru='При необходимости изменить начисления учащегося ""%1"", нажмите ""Изменить учащегося"".'");
					
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Студент", ТекущиеДанные.Студент);
		ДопПараметры.Вставить("Начисление", ТекущиеДанные.Ссылка);
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьВопросОРедактировании", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ТекущиеДанные.Студент), КнопкиДиалога);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("Справочник.НачисленияСтудентамЗаПрочиеУслуги.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОбработатьВыборПериода(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		НачалоПериода = НачалоМесяца(Результат);
		КонецПериода = КонецМесяца(Результат);
		
		УстановитьПараметрСпискаПериод();
		УстановитьПредставлениеПериода();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросОРедактировании(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ДопПараметры.Начисление);
		ОткрытьФорму("Справочник.НачисленияСтудентамЗаПрочиеУслуги.Форма.ФормаЭлемента", ПараметрыФормы);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ДопПараметры.Студент);
		ОткрытьФорму("Справочник.Студенты.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьПараметрСтудент()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтборСтудент", 
		?(ЗначениеЗаполнено(ОтборСтудент), ОтборСтудент, Справочники.Студенты.ПустаяСсылка()), Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНачисление()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ссылка",
		ОтборНачисление, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ОтборНачисление));
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВидуНачисления(ВидНачисления)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидНачисления",
		ВидНачисления, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ВидНачисления));
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрСпискаПериод()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НачалоПериода",
		?(ЗначениеЗаполнено(НачалоПериода), НачалоПериода, '00010101000000'), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "КонецПериода",
		?(ЗначениеЗаполнено(КонецПериода), КонецПериода, '00010101000000'), Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Студент", "Видимость", Не ЗначениеЗаполнено(ОтборСтудент));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВидНачисления", "Видимость", Не ЕстьОтборПоВидуНачисления);
	
	ПараметрыКраткосрочныхДоговоров = Новый Массив;
	ПараметрыКраткосрочныхДоговоров.Добавить("СтавкаОплаты");
	ПараметрыКраткосрочныхДоговоров.Добавить("Льгота");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ПараметрыКраткосрочныхДоговоров, "Видимость", НЕ ПоДолгосрочнымДоговорам);
	
	ПараметрыДолгосрочныхДоговоров = Новый Массив;
	ПараметрыДолгосрочныхДоговоров.Добавить("ГрафикОплаты");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ПараметрыДолгосрочныхДоговоров, "Видимость", ПоДолгосрочнымДоговорам);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОтборНачисление", "ТолькоПросмотр", ЗначениеЗаполнено(ОтборНачисление));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОтборСтудент", "ТолькоПросмотр", ЗначениеЗаполнено(ОтборСтудент));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОтборПериод", "Доступность", Не ЗначениеЗаполнено(НачалоПериода) И Не ЗначениеЗаполнено(КонецПериода));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПериода()
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		ОтборПериод = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "Л=ru_RU");
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) И Не ЗначениеЗаполнено(КонецПериода) Тогда
		ОтборПериод = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 - <...>'"), Формат(НачалоПериода, "ДЛФ=D"));
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) И Не ЗначениеЗаполнено(КонецПериода) Тогда
		ОтборПериод = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='<...> - %1'"), Формат(НачалоПериода, "ДЛФ=D"));
	Иначе
		ОтборПериод = НСтр("ru='<не установлен>'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрНаДату()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаДату", ОтборНаДату, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ДопПараметры = ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры;
		
		Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;
		
		ДопПараметры.Вставить("НачислениеЗаУслугу", ТекущиеДанные.Ссылка);
		ДопПараметры.Вставить("ВидНачисления", ТекущиеДанные.ВидНачисления);
		ДопПараметры.Вставить("СтавкаОплаты", ТекущиеДанные.СтавкаОплаты);
		ДопПараметры.Вставить("ГрафикОплаты", ТекущиеДанные.ГрафикОплаты);
		ДопПараметры.Вставить("ПорядокВыпискиСФ", ?(ЗначениеЗаполнено(ТекущиеДанные.ПорядокВыпискиСФ), ТекущиеДанные.ПорядокВыпискиСФ, ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.Сводно")));
		ДопПараметры.Вставить("ПериодНачисленияНачало", ?(ТекущиеДанные.НачалоНачисления > НачалоПериода, ТекущиеДанные.НачалоНачисления, НачалоПериода));
		ДопПараметры.Вставить("ПериодНачисленияКонец", ?(ТекущиеДанные.ОкончаниеНачисления < КонецПериода И ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеНачисления), ТекущиеДанные.ОкончаниеНачисления, КонецПериода));
		ДопПараметры.Вставить("УчитыватьНДС", ТекущиеДанные.УчитыватьНДС);
		ДопПараметры.Вставить("СтавкаНДС", ТекущиеДанные.СтавкаНДС);
		
		Если Не ТекущиеДанные.РазовоеНачисление Тогда
			ДопПараметры.Вставить("Студент", ТекущиеДанные.Студент);
			ДопПараметры.Вставить("Контрагент", ТекущиеДанные.Плательщик);
			ДопПараметры.Вставить("ДоговорКонтрагента", ТекущиеДанные.Договор);
			ДопПараметры.Вставить("Льгота", ТекущиеДанные.Льгота);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
